[{"pub":true,"postType":"text","title":"Example #1 Using global","keywords":["php","global","text"],"content":"This script will not produce any output because the echo statement refers to a local version of the  variable, and it has not been assigned a value within this scope. You may notice that this is a little bit different from the C language in that global variables in C are automatically available to functions unless specifically overridden by a local definition. This can cause some problems in that people may inadvertently change a global variable. In PHP global variables must be declared global inside a function if they are going to be used in that function.","author":"admin","date":1377268718},{"pub":true,"postType":"text","title":"Example #1 Using global","keywords":["php","global","text"],"content":"This script will not produce any output because the echo statement refers to a local version of the $a variable, and it has not been assigned a value within this scope. You may notice that this is a little bit different from the C language in that global variables in C are automatically available to functions unless specifically overridden by a local definition. This can cause some problems in that people may inadvertently change a global variable. In PHP global variables must be declared global inside a function if they are going to be used in that function.","author":"admin","date":1377271268},{"pub":true,"postType":"text","title":"Example #1 Using global","keywords":["php", "global", "text"],"content":"This script will not produce any output because the echo statement refers to a local version of the $a variable, and it has not been assigned a value within this scope. You may notice that this is a little bit different from the C language in that global variables in C are automatically available to functions unless specifically overridden by a local definition. This can cause some problems in that people may inadvertently change a global variable. In PHP global variables must be declared global inside a function if they are going to be used in that function.","author":"admin","date":1377277294}]